---
kind: property
id: P:Autodesk.Revit.DB.IConnector.Radius
source: html/99f43e48-6cae-b62c-5928-7b68682d9a42.htm
---
# Autodesk.Revit.DB.IConnector.Radius Property

The radius of the connector.

## Syntax (C#)
```csharp
double Radius { get; }
```

## Remarks
This property is used to retrieve the radius of the connector.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the connector's shape is not round.